#+TITLE: Emacs Configuration Generation File
#+AUTHOR: Peter Prevos
#+PROPERTY: header-args :tangle yes :tangle ~/.emacs.d/init.el :results silent

** Basic configuration

- [[https://orgmode.org/manual/Workflow-states.html#Workflow-states][Workflow states]]

#+BEGIN_SRC emacs-lisp
;; Keyboard shortcuts
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cc" 'org-capture)
(global-set-key "\C-cb" 'org-iswitchb)

;; Workflow states
(setq org-todo-keywords
  '((sequence "TODO(t)" "WAITING(w)" "PROJECT(p)" "SOMEDAY(s)" "|" "DONE(d)" "CANCELLED(c)")))
#+END_SRC

#+RESULTS:
| sequence | TODO(t) | WAITING(w) | PROJECT(p) | SOMEDAY(s) |   |   | DONE(d) | CANCELLED(c) |

